{
"Journal Articles": [
    {
        "id":  "NMC_SLSBRD",
        "year": 2024,
        "title": "SLS-BRD: A system-level approach to seeking generalised feedback Nash equilibria",
        "author": "O. Neto, M. Mulas, F. Corona",
        "journal": "_",
        "volume": "_",
        "number": "_",
        "pages": "_",
        "doi": "",
        "bibtex": "",
        "pdf": "NMC_SLSBRD.pdf",
        "mp4": "",
        "abstract": "This work proposes a policy learning algorithm for generalised feedback Nash equilibrium seeking in $N_P$-players non-cooperative dynamic games. We consider linear-quadratic games with stochastic dynamics and design a best-response dynamics in which players update and communicate a parametrisation of their state-feedback policies. Our approach leverages the System Level Synthesis (SLS) framework to formulate each player\\'s update rule as the solution of a tractable robust optimisation problem. Under certain conditions, the conditions and rates of convergence can be established. The algorithm is showcased for an exemplary problem from decentralised control of multi-agent systems.",
        "notes": "(Preprint)"
    },
    {
        "id":  "NMC_BSM1_Control",
        "year": 2024,
        "title": "A control-based framework for operating activated sludge plants",
        "author": "O. Neto, M. Mulas, F. Corona",
        "journal": "_",
        "volume": "_",
        "number": "_",
        "pages": "_",
        "doi": "",
        "bibtex": "",
        "pdf": "",
        "mp4": "",
        "abstract": "",
        "notes": "In preparation"
    },
    {
        "id":  "NMC_BSM1_Analysis",
        "year": 2022,
        "title": "About the classical and structural controllability and observability of a common class of activated sludge plants",
        "author": "O. Neto, M. Mulas, F. Corona",
        "journal": "Journal of Process Control",
        "volume": "111",
        "number": "",
        "pages": "8-26",
        "doi": "https://doi.org/10.1016/j.jprocont.2021.12.013",
        "bibtex": "@article{NMC_BSM1_Analysis, \\n\t title = {About the classical and structural controllability and observability of a common class of activated sludge plants}, \\n\t author = {Otacílio B.L. Neto and Michela Mulas and Francesco Corona}, \\n\t journal = {Journal of Process Control}, \\n\t volume = {111}, \\n\t pages = {8-26}, \\n\t year = {2022}, \\n\t issn = {0959-1524}, \\n\t doi = {https://doi.org/10.1016/j.jprocont.2021.12.013}, \\n\t url = {https://www.sciencedirect.com/science/article/pii/S0959152421002390} \\n }",
        "pdf": "NMC_BSM1Analysis.pdf",
        "mp4": "",
        "abstract": "In this work, the stability, controllability and observability properties of a class of activated sludge plants are analysed. Specifically, the five biological reactors and the secondary settler in the Benchmark Simulation Model no. 1 (BSM1) are studied. For the task, we represented the plant as a dynamical system consisting of 145 state variables, 13 controls, 14 disturbances and 15 outputs and as a complex networks to study its full-state controllability and observability properties from a structural and a classical point of view. By analysing the topology of the network, we show how this class of systems is controllable but not observable in a structural sense, and thus how it is controllable but not observable in a classical sense for almost all possible realisations. We also show how a linearisation commonly used in the literature is neither full-state controllable nor full-state observable in the classical sense. The control and observation efforts are quantified in terms of energy- and centrality-based based metrics.",
        "notes": ""
    }
],
"Conference Articles": [
    {
        "id": "BPF4ReacDiff_IFAC",
        "title": "Block particle filters for state estimation of stochastic reaction-diffusion systems",
        "author": "J.A. Magalhães, O. Neto, F. Corona",
        "booktitle": "In Proc: 22st International Federation of Automatic Control (IFAC) World Congress",
        "pages": "pp. 10270-10275",
        "year": 2023,
        "organization": "IFAC",
        "notes": "",
        "bibtex": "@article{MAGALHAES202310270, \\n\\t author = {José Augusto F. Magalhães and Otacílio B.L. Neto and Francesco Corona}, \\n\\t title = {Block particle filters for state estimation of stochastic reaction-diffusion systems}, \\n\\t journal = {IFAC-PapersOnLine}, \\n\\t volume = {56}, \\n\\t number = {2}, \\n\\t pages = {10270-10275}, \\n\\t year = {2023}, \\n\\t note = {22nd IFAC World Congress}, \\n\\t issn = {2405-8963}, \\n\\t doi = {https://doi.org/10.1016/j.ifacol.2023.10.910}, \\n }",
        "pdf": "BPF4ReacDiff_IFAC.pdf",
        "mp4": "",
        "doi": "https://doi.org/10.1016/j.ifacol.2023.10.910",
        "abstract": "In this work, we consider a differential description of the evolution of the state of a reaction-diffusion system under environmental fluctuations. We are interested in estimating the state of the system when only partial observations are available. To describe how observations and states are related, we combine multiplicative noise-driven dynamics with an observation model. More specifically, we ensure that the observations are subjected to error in the form of additive noise. We focus on the task of reconstructing the state of a Belousov-Zhabotinskii chemical reaction. We simulate a reaction conducted in a quasi-two-dimensional physical domain, such as on the surface of a Petri dish. We aim at reconstructing the emerging chemical patterns based on noisy spectral observations. For this task, we consider a finite-difference representation on the spatial domain, where nodes are chosen according to observation sites. We approximate the solution to this state estimation problem with the Block Particle Filter, a Sequential Monte Carlo method capable to address the associated high-dimensionality of this state-space representation."
    },
    {
        "id": "BSM1_DYCOPS",
        "title": "Online optimal estimation and control for a common class of activated sludge plants",
        "author": "O. Neto, M. Mulas, F. Corona",
        "booktitle": "In Proc: 13th IFAC Symposium on Dynamics and Control of Process Systems, including Biosystems (DYCOPS)",
        "pages": "pp. 447-452",
        "year": 2022,
        "organization": "IFAC",
        "notes": "",
        "bibtex": "@article{NMC_BSM1Control_DYCOPS, \\n\t title = {Online optimal estimation and control for a common class of activated sludge plants}, \\n\t author = {Otacílio B.L. Neto and Michela Mulas and Francesco Corona}, \\n\t journal = {IFAC-PapersOnLine}, \\n\t volume = {55}, \\n\t number = {7}, \\n\t pages = {447-452}, \\n\t year = {2022}, \\n\t note = {13th IFAC Symposium on Dynamics and Control of Process Systems, including Biosystems DYCOPS 2022}, \\n\t issn = {2405-8963}, \\n\t doi = {https://doi.org/10.1016/j.ifacol.2022.07.484}\\n }",
        "pdf": "BSM1_DYCOPS22.pdf",
        "mp4": "BSM1_DYCOPS_PresentationVideo.mp4",
        "doi": "https://doi.org/10.1016/j.ifacol.2022.07.484",
        "abstract": "In this work, we design an output predictive controller that operates a common class of activated sludge plants. The controller solves a state-feedback model predictive control problem in which the process state and disturbances are determined by a moving horizon estimator. We illustrate the behaviour of the controller when operating the plant to produce an effluent water of varying nitrogen content. The close tracking of the effluent profiles is enforced by stabilizing the system around optimal steady-state points that satisfy the output reference trajectories. Considering the generality of the formulation, the predictive controller can be configured to operate this class of activated sludge plants to achieve alternative objectives."
    },
    {
        "id": "BSM1_ADCHEM",
        "title": "Predictive control of activated sludge plants to supply nitrogen for optimal crop growth",
        "author": "O. Neto, A. Haddon, F. Aichouche, J. Harmand, M. Mulas, F. Corona",
        "booktitle": "In Proc: 11th IFAC Symposium on Advanced Control of Chemical Processes (ADCHEM)",
        "pages": "pp. 200-205",
        "year": 2021,
        "organization": "IFAC",
        "notes": "",
        "bibtex": "@article{Neto2021a, \\n\t title = {Predictive control of activated sludge plants to supply nitrogen for optimal crop growth}, \\n\t journal = {IFAC-PapersOnLine}, \\n\t author = {Otacílio B. L. Neto and Antoine Haddon and Farouk Aichouche and Jerome Harmand and Michela Mulas and Francesco Corona}, \\n\t year = {2021}, \\n\t volume = {54}, \\n\t number = {3}, \\n\t pages = {200-205}, \\n\t note = {11th IFAC Symposium on Advanced Control of Chemical Processes}, \\n\t issn = {2405-8963}, \\n\t doi = {https://doi.org/10.1016/j.ifacol.2021.08.242}, \\n\t url = {https://www.sciencedirect.com/science/article/pii/S2405896321010132}\\n }",
        "pdf": "BSM1_ADCHEM21.pdf",
        "mp4": "BSM1_ADCHEM21_Presentation.mp4",
        "doi": "https://doi.org/10.1016/j.ifacol.2021.08.242",
        "abstract": "We report the preliminary results of a feasibility study in which we investigate the possibility to operate a common class of activated sludge plants to produce effluent wastewater of varying quality for crop irrigation. Firstly, a nitrogen reference trajectory is computed as solution to a higher-level optimal control problem that aims at maximizing plant biomass in a crop growth system. We then study how to control the treatment plant with a zero-offset predictive control strategy designed to operate the treatment process to supply nitrogen according to this optimal planning for crop growth. We show how an ad hoc tuning of the predictive controller allows to define alternative policies that favour the manipulation of different forms of nitrogen in the treatment plant. We show that the designed controllers are only partially capable to operate the treatment plant to meet the nitrogen demand, when subjected to typical municipal wastewater influent conditions. However, zero-offset can be achieved under constant influent conditions. We analyse the performance of the controller in terms of tracking accuracy and operational energy."
    },
    {
        "id": "BSM1_IFAC",
        "title": "On the observability of activated sludge plants",
        "author": "O. Neto, M. Mulas, F. Corona",
        "booktitle": "In Proc: 21st International Federation of Automatic Control (IFAC) World Congress",
        "pages": "pp. 16802-16807",
        "year": 2020,
        "organization": "IFAC",
        "notes": "",
        "bibtex": "@article{Neto2020b, \\n\t author = {Otacílio B. L. Neto and Michela Mulas and Francesco Corona},\\n\t title = {On the observability of activated sludge plants},\\n\t journal = {IFAC-PapersOnLine},\\n\t volume = {53},\\n\t number = {2},\\n\t pages = {16802-16807},\\n\t year = {2020},\\n\t note = {21st IFAC World Congress},\\n\t issn = {2405-8963},\\n\t doi = {https://doi.org/10.1016/j.ifacol.2020.12.1151},\\n\t url = {https://www.sciencedirect.com/science/article/pii/S2405896320315408},\\n}",
        "pdf": "BSM1_obsv.pdf",
        "mp4": "BSM1_obsv_presentation.mp4",
        "doi": "http://doi.org/10.1016/j.ifacol.2020.12.1151",
        "abstract": "In this work, the full-state observability properties of a class of biological wastewater treatment plants are analysed. Specifically, the five biological reactors and the secondary settler in the Benchmark Simulation Model no. 1 are studied. For the task, we represented the activated sludge plant as a dynamical system consisting of 145 states, 8 controls, 14 disturbances and 12 outputs and as a complex network to study its observability properties from a structural and a classical point of view. By analysing the topology of the network, we show how the system is not observable in the structural sense and thus how it is also not observable in the classical sense for all possible realisations of its parameters. As this is also true for a linearisation commonly used in the literature, we analysed a reduced-order system that, based on such linearisation, does not consider the state variables corresponding to dissolved oxygen and alkalinity in the upper-layers of the settler. We show how this system configuration is only observable in a structural sense."
    },
    {
        "id": "BSM1_ECC",
        "title": "On the controllability of activated sludge plants",
        "author": "O. Neto, M. Mulas, F. Corona",
        "booktitle": "In Proc: 2020 European Control Conference (ECC)",
        "pages": "pp. 581-586.",
        "year": 2020,
        "organization": "IEEE",
        "notes": "",
        "bibtex": "@inproceedings{Neto2020a,\\n\t author={O. B. L. {Neto} and M. {Mulas} and F. {Corona}},\\n\t booktitle={2020 European Control Conference (ECC)}, \\n\t title={On the controllability of activated sludge plants}, \\n\t year={2020},\\n\t volume={},\\n\t number={},\\n\t pages={581-586},\\n\t doi={10.23919/ECC51009.2020.9143863},\\n\t ISSN={},\\n\t month={May},\\n}\\n",
        "pdf": "BSM1_ctrb.pdf",
        "mp4": "BSM1_ctrb_presentation.mp4",
        "doi":"http://doi.org/10.23919/ECC51009.2020.9143863",
        "abstract": "In this work, the full-state controllability properties of a biological wastewater treatment plant are analysed. Specifically, the five biological reactors in the Benchmark Simulation Model no. 1 are studied. For the task, we represented the activated sludge plant as a dynamical system consisting of 65 states, 7 controls and 27 disturbances as a complex network and we studied its controllability properties from a classical and a structural point of view. By analysing the topology of the network, we show how the system is controllable in the structural sense and thus how it is controllable in the classical sense for almost all realisations of its parameters. Interestingly, we also found that the linearisation around a fixed point commonly used in the literature leads to a realisation of the system that is not full-state controllable in the classical sense. We show how this realisation is controllable if the state variables associated with inert matter are not considered. We quantify the compound and individual control efforts of this reduced-order system in terms of energy-based controllability metrics."
    }
],
"Thesis/Dissertations": [
    {
        "id": "Neto_BMsc",
        "author": "O. B. L. Neto",
        "title": "Optimal control and estimation of activated sludge plants",
        "level": "M.Sc Thesis",
        "department": "Postgraduate Programme in Teleinformatics Engineering",
        "university": "Federal University of Ceará",
        "year": 2021,
        "note": "",
        "bibtex": "@phdthesis{Neto2019Master,\\n\t author = {Otacílio Bezerra Leite {Neto}}, \\n\t title = {Optimal control and estimation of activated sludge plants},\\n\t school = {Universidade Federal do Ceará},\\n\t year = {2021},\\n\t type = {M.Sc. Thesis}\\n}\\n",
        "pdf": "masters_ufc.pdf",
        "doi": "",
        "abstract": "Wastewater treatment is facing unprecedented challenges due to stricter effluent requirements, costs minimisation, sustainable reuse of water, nutrients, and other resources, as well as increasing expectations in the public to attain high service standards. Due to their wide diffusion, activated sludge processes play a key role in the biological treatment of wastewater and their efficient operation has a large technological and societal impact. The discipline of control theory offers the mathematical framework for steering wastewater treatment systems toward a desired state. Model predictive control (MPC) and moving horizon estimation (MHE) have been the chosen technologies for many industrial applications, including treatment plants. In this work, the dynamical properties and optimal operation of activated sludge plants are investigated. For the first task, the dynamical system consisting of 145 state variables, 13 controls, 14 disturbances, and 15 outputs, is mapped onto complex networks in which full-state controllability and observability properties are studied, from both a structural and a classical point of view. For the second task, optimal control and estimation strategies are designed for operating an activated sludge plant for both wastewater treatment and reuse operations. In wastewater reuse, a zero-offset predictive controller is designed to operate the plant when it is required to produce water of tailored quality to be used for agricultural crop fertigation. The optimal control and estimation problems are solved through the direct transcription method consisting of converting the problems into nonlinear programs, then solving them numerically. According to our results, activated sludge plants are only controllable in a structural sense, being uncontrollable in the conventional sense and unobservable both in the structural and conventional sense. Being stable under the conventional operation, these processes are still stabilizable and detectable, despite their control and observation being qualified as high-demanding tasks. We present and discuss the simulation results for a predictive controller that is capable to improve the performance of the plant for wastewater treatment under different influent regimes. Then, we show and discuss the results for a zero-offset controller that is capable to track a reference trajectory under constant influent conditions, albeit being only partially capable to track these set-points under dynamic influent. Finally, results are presented for the output model predictive controllers based on partial, noisy, measurements of the plant’s internal state. "
    },
    {
        "id": "Neto_BEng",
        "author": "O. B. L. Neto",
        "title": "Optimal Control: An application to a non-isothermal continuous reactor",
        "level": "B.Eng Thesis",
        "department": "Department of Teleinformatics Engineering",
        "university": "Federal University of Ceará",
        "year": 2019,
        "note": "",
        "bibtex": "@phdthesis{Neto2019Bachelor,\\n\t author = {Otacílio Bezerra Leite {Neto}}, \\n\t title = {Optimal Control: An application to a non-isothermal continuous reactor},\\n\t school = {Universidade Federal do Ceará},\\n\t year = {2019},\\n\t type = {B.Eng. Thesis}\\n}\\n",
        "pdf": "bachelor_ufc.pdf",
        "doi": "",
        "abstract": "The discipline of Control Systems Engineering has become ubiquitous in most modern technological applications. Recently, given the advances in fields such as Reinforcement Learning, attention has been drawn to the need for solving control problems from highly complex systems in conditions loaded with uncertainty. Given this motivation, the field of Optimal and Robust Control presents itself as a feasible solution to these problems. These techniques accounts for the design of automatic controllers that manipulates a system in order to optimize an objective function, considering also the possibility for uncertainty in any aspect of this process. In this work, the main results in optimal control are revisited in detail, focusing in the classical Linear Quadratic (LQ) controllers which assumes a linear model of a system and a quadratic performance index to be minimized. The optimization discussed in this work is solved through a Dynamic Programming approach. In addition to this, optimal state estimators, namely Kalman Filter estimators, are formulated and integrated to the optimal controllers in order to deal with the uncertainty regarding the real state of a system. As building blocks for these concepts, the general results for dynamical systems modeling and control is also presented, although only the most important and recurrent theorems are described in detail. The controllers are evaluated in the light of a specific class of chemical processes, the continuous stirred tank reactors (CSTR). A specific model of a system within this class, which is highly nonlinear and loaded with uncertainty, is used in simulation as a benchmark to demonstrate the optimal and robust approach."
    }
]
}
